```sql
Table: Logs
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| log_id        | int     |
+---------------+---------+
id is the primary key for this table.
Each row of this table contains the ID in a log Table.
Since some IDs have been removed from Logs. Write an SQL query to find the start and end number of continuous ranges in table Logs.
Order the result table by start_id.
The query result format is in the following example:
Logs table:
+------------+
| log_id     |
+------------+
| 1          |
| 2          |
| 3          |
| 7          |
| 8          |
| 10         |
+------------+

Result table:
+------------+--------------+
| start_id   | end_id       |
+------------+--------------+
| 1          | 3            |
| 7          | 8            |
| 10         | 10           |
+------------+--------------+
The result table should contain all ranges in table Logs.
From 1 to 3 is contained in the table.
From 4 to 6 is missing in the table
From 7 to 8 is contained in the table.
Number 9 is missing in the table.
Number 10 is contained in the table.
```

======== SQL =======

```sql

SELECT min(log_id) as start_id, max(log_id) as end_id
FROM
(SELECT log_id, ROW_NUMBER() OVER(ORDER BY log_id) as rnk
FROM Logs) a
GROUP BY log_id - rnk
```

In [61]:
import pandas as pd
a = [1,2,3,7,8,10,12,13]

In [63]:
data = pd.DataFrame(a,columns=['num'])

In [64]:
data

   num
0    1
1    2
2    3
3    7
4    8
5   10
6   12
7   13

In [65]:
data = data.sort_values('num')

In [66]:
data['idx'] = data.index

In [67]:
data

   num  idx
0    1    0
1    2    1
2    3    2
3    7    3
4    8    4
5   10    5
6   12    6
7   13    7

In [68]:
data['delta'] = data.num - data.idx

In [69]:
data

   num  idx  delta
0    1    0      1
1    2    1      1
2    3    2      1
3    7    3      4
4    8    4      4
5   10    5      5
6   12    6      6
7   13    7      6

In [70]:
data.groupby('delta')['num'].agg(['min', 'max'])

       min  max
delta
1        1    3
4        7    8
5       10   10
6       12   13